CSI API ETABS v1
cDesignSteel.GetSummaryResults Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSummaryResults(
	string Name,
	ref int NumberItems,
	ref string[] FrameName,
	ref double[] Ratio,
	ref int[] RatioType,
	ref double[] Location,
	ref string[] ComboName,
	ref string[] ErrorSummary,
	ref string[] WarningSummary,
	eItemType ItemType = eItemType.Objects
)
Function GetSummaryResults (
	Name As String,
	ByRef NumberItems As Integer,
	ByRef FrameName As String(),
	ByRef Ratio As Double(),
	ByRef RatioType As Integer(),
	ByRef Location As Double(),
	ByRef ComboName As String(),
	ByRef ErrorSummary As String(),
	ByRef WarningSummary As String(),
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cDesignSteel
Dim Name As String
Dim NumberItems As Integer
Dim FrameName As String()
Dim Ratio As Double()
Dim RatioType As Integer()
Dim Location As Double()
Dim ComboName As String()
Dim ErrorSummary As String()
Dim WarningSummary As String()
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.GetSummaryResults(Name,
	NumberItems, FrameName, Ratio, RatioType,
	Location, ComboName, ErrorSummary,
	WarningSummary, ItemType)
int GetSummaryResults(
	String^ Name,
	int% NumberItems,
	array<String^>^% FrameName,
	array<double>^% Ratio,
	array<int>^% RatioType,
	array<double>^% Location,
	array<String^>^% ComboName,
	array<String^>^% ErrorSummary,
	array<String^>^% WarningSummary,
	eItemType ItemType = eItemType::Objects
)
abstract GetSummaryResults :
        Name : string *
        NumberItems : int byref *
        FrameName : string[] byref *
        Ratio : float[] byref *
        RatioType : int[] byref *
        Location : float[] byref *
        ComboName : string[] byref *
        ErrorSummary : string[] byref *
        WarningSummary : string[] byref *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
NumberItems
Type: System.Int32
FrameName
Type: System.String[]
Ratio
Type: System.Double[]
RatioType
Type: System.Int32[]
Location
Type: System.Double[]
ComboName
Type: System.String[]
ErrorSummary
Type: System.String[]
WarningSummary
Type: System.String[]
ItemType (Optional)
Type: ETABSv1.eItemType
Return Value
Type: Int32
See Also
Reference
cDesignSteel Interface
ETABSv1 Namespace